;; -*- no-byte-compile: t; -*-
;;; private/russ/packages.el

(package! flycheck-mix)
(package! flycheck-credo)
(package! helm-core)
(package! cider)
(package! paredit)
(package! clojure-mode)
(package! flycheck-clojure)
(package! racket-mode)
(package! geiser)
(package! quack)
(package! intero)
(package! ghc)
(package! dash)
