# zsh plugins for use with antibody/antidote

zsh-users/zsh-completions
caarlos0/zsh-mkc
djui/alias-tips
Tarrasch/zsh-autoenv
Tarrasch/zsh-colors
chisui/zsh-nix-shell

ohmyzsh/ohmyzsh
ohmyzsh/ohmyzsh path:plugins/aws
ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/cabal
ohmyzsh/ohmyzsh path:plugins/command-not-found
ohmyzsh/ohmyzsh path:plugins/common-aliases
ohmyzsh/ohmyzsh path:plugins/compleat
ohmyzsh/ohmyzsh path:plugins/dircycle
# ohmyzsh/ohmyzsh path:plugins/dirhistory
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/fasd
# ohmyzsh/ohmyzsh path:plugins/gas
ohmyzsh/ohmyzsh path:plugins/geeknote
ohmyzsh/ohmyzsh path:plugins/gpg-agent
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/gitfast
ohmyzsh/ohmyzsh path:plugins/git-extras
ohmyzsh/ohmyzsh path:plugins/git-flow
ohmyzsh/ohmyzsh path:plugins/git-flow-avh
ohmyzsh/ohmyzsh path:plugins/git-hubflow
ohmyzsh/ohmyzsh path:plugins/github
# ohmyzsh/ohmyzsh path:plugins/httpie
ohmyzsh/ohmyzsh path:plugins/history
ohmyzsh/ohmyzsh path:plugins/jsontools
ohmyzsh/ohmyzsh path:plugins/kubectl
ohmyzsh/ohmyzsh path:plugins/last-working-dir
ohmyzsh/ohmyzsh path:plugins/node
ohmyzsh/ohmyzsh path:plugins/npm
# ohmyzsh/ohmyzsh path:plugins/osx
# ohmyzsh/ohmyzsh path:plugins/per-directory-history
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/python
ohmyzsh/ohmyzsh path:plugins/pylint
# ohmyzsh/ohmyzsh path:plugins/pyenv
ohmyzsh/ohmyzsh path:plugins/rand-quote
ohmyzsh/ohmyzsh path:plugins/repo
# ohmyzsh/ohmyzsh path:plugins/ssh-agent
ohmyzsh/ohmyzsh path:plugins/sudo
ohmyzsh/ohmyzsh path:plugins/taskwarrior
ohmyzsh/ohmyzsh path:plugins/tig
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/urltools
ohmyzsh/ohmyzsh path:plugins/vi-mode
ohmyzsh/ohmyzsh path:plugins/web-search
ohmyzsh/ohmyzsh path:plugins/yarn

# https://gist.github.com/rschmukler/7d9317cde82c58be965d rs2.zsh-theme

# mafredri/zsh-async
# sindresorhus/pure
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-history-substring-search

jonmosco/kube-ps1
# ahmetb/kubectx

johanhaleby/kubetail

# NullSense/fuzzy-sys
wfxr/forgit
changyuheng/zsh-interactive-cd
